Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །གསུམ་པ་ནི་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་གཤེགས་པ་དང་བྱོན་པ་མི་མངའ་ཞིང་ལེན་པ་མི་མངའ་བ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་སྐུ་སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་པ་ཡིན་པས་སྐྱེ་བ་དང་འགག་པ་མེད་པར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Third, in that way the tathāgatas have no going, they have no coming, and have no grasping, which is the Dharma body, which has no birth and no cessation; this absence of birth and cessation is called nirvāṇa. “

source: །བཞི་པ་ནི་སྐྱེ་བ་དང་འགག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚིག་གིས་བརྗོད་པར་བྱ་བ་མ་ཡིན་ཏེ། ཚིག་གི་ལམ་ཡོངས་སུ་ཆད་པར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Fourth, that absence of birth and cessation is indescribable in words; it is beyond the scope of words, and therefore this is called nirvāṇa. “

source: །ལྔ་པ་ནི་བདག་དང་གང་ཟག་མེད་ཀྱི་ཆོས་ཙམ་འབའ་ཞིག་སྐྱེ་འགག་ཏུ་གྱུར་པའི་གནས་སུ་གྱུར་པ་བརྙེས་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Fifth, there is the attainment of the transformation of birth and cessation being solely that of phenomena having no self and no individual, and therefore this is called nirvāṇa. “

source: །དྲུག་པ་ནི་ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ནི་བློ་བུར་གྱི་རྡུལ་ཡིན་ལ་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ནི་བདག་པོ་ཡིན་ཏེ།
en: Sixth, the buddhas have realized that the kleśas and the proximate kleśas are incidental stains and that the true nature is primary and has no going or coming.

source: འགྲོ་བ་མེད་ཅིང་འོང་བ་མེད་པར་སངས་རྒྱས་རྣམས་ཀྱིས་ཐུགས་སུ་ཆུད་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Therefore, this is called nirvāṇa. “

source: །བདུན་པ་ནི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པ་ཡིན་ལ་གཞན་ཐམས་ཅད་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཡིན་པས་ཡང་དག་པའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་ཡིན་ལ།
en: Seventh, that which is the true nature is valid, and everything else is invalid.

source: དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཡིན་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Therefore, that which is the valid true nature is a tathāgata, and therefore this is called nirvāṇa. “

source: །བརྒྱད་པ་ནི་ཡང་དག་པའི་མཐའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ལ་ནི་སྤྲོས་པ་མེད་དེ། དེ་བཞིན་གཤེགས་པ་ཉག་གཅིག་གིས་ཡང་དག་པའི་མཐའི་ཆོས་མངོན་སུམ་དུ་གྱུར་ནས། སྤྲོས་པ་གཏན་དུ་བཅད་པས་ན། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Eighth, that which is the ultimate conclusion is free of mental elaboration, and only a tathāgata directly perceives that ultimate conclusion; that elimination of mental elaboration is called nirvāṇa. “

source: །དགུ་པ་ནི་སྐྱེ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པ་ཡིན་ལ། སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་མི་བདེན་པ་ཡིན་པས་བྱིས་པ་བླུན་པོ་རྣམས་འཁོར་བར་བྱིང་ཞིང་འདོད་པས་ཁྱེར་བ་ཡིན་ན། དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ནི་ཡང་དག་པར་མི་བདེན་པ་མི་མངའ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Ninth, that which is birthlessness is valid, and that which is birth is untrue, and so childlike fools sink into the swamp of saṃsāra and are swept away by desire, while the body of the Tathāgata is truly without any invalidity—this is called nirvāṇa. “

source: །བཅུ་པ་ནི་ཡང་དག་པའི་ཆོས་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ནི་རྐྱེན་ལས་བྱུང་བ་ཡིན་ལ་ཡང་དག་པའི་ཆོས་གང་ཡིན་པ་དེ་ནི་རྐྱེན་ལས་བྱུང་བ་མ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་སྐུའི་ངོ་བོ་ཉིད་དང་ཡིན་པ་དེ་ནི་ཡང་དག་པ་ཡིན་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་སྟེ།
en: Tenth, invalid phenomena arise from conditions, while that which is a valid phenomenon does not arise from conditions; the nature of that which is the Dharma body of a tathāgata is valid, and therefore this is called nirvāṇa. “

source: རིགས་ཀྱི་བུ་འདི་དག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཡོད་པར་བསྟན་པའི་ཆོས་རྣམས་པ་བཅུ་ཞེས་བྱའོ། །གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་འདི་ལྟར་ཡང་ཆོས་རྣམ་པ་བཅུས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་དེ་ཁོ་ན་ཉིད་ཀྱི་དོན་གྱི་ཚུལ་གྱིས་མཐར་ཕྱིན་པའི་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཡོད་པར་གསུངས་པ་གང་ཡིན་པ་ཤེས་པར་འགྱུར་བར་རིག་པར་བྱའོ།
en: Also, noble one, the bodhisattvas mahāsattvas know and understand in this way, through these ten qualities, that the Tathāgata Arhat Samyaksaṃbuddha teaches the ultimate, great passing into nirvāṇa according to the meaning of its true nature. “

source: དང་པོ་ནི་དེ་བཞིན་གཤེགས་པས་སྦྱིན་པ་དང་སྦྱིན་པའི་འབྲས་བུ་ལ་བདག་དང་བདག་གི་བ་མེད་པར་ལེགས་པར་ཐུགས་སུ་ཆུད་པས་སྦྱིན་པ་དང་སྦྱིན་པའི་འབྲས་བུ་དེ་ལ་ལོག་པར་རྟོག་པ་གཏན་དུ་བསལ་ནས་ཞི་བར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: First, the tathāgatas have perfectly realized that there is no ‘me’ or ‘mine’ in generosity or the results of generosity; therefore, they have completely dispelled incorrect views of generosity and its results, and thus this is called nirvāṇa. “

source: །གཉིས་པ་ནི་དེ་བཞིན་གཤེགས་པས་ཚུལ་ཁྲིམས་དང་ཚུལ་ཁྲིམས་ཀྱི་འབྲས་བུ་ལ་བདག་དང་བདག་གི་བ་མེད་པར་ལེགས་པར་ཐུགས་སུ་ཆུད་པས་ཚུལ་ཁྲིམས་དང་ཚུལ་ཁྲིམས་ཀྱི་འབྲས་བུ་དེ་ལ་ལོག་པར་རྟོག་པ་གཏན་དུ་བསལ་ནས་ཞི་བར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Second, the tathāgatas have perfectly realized that there is no ‘me’ or ‘mine’ in correct conduct and the results of correct conduct; therefore, they have completely dispelled incorrect views of correct conduct and its results, and thus this is called nirvāṇa. “

source: །གསུམ་པ་ནི་དེ་བཞིན་གཤེགས་པས་བཟོད་པ་དང་བཟོད་པའི་འབྲས་བུ་ལ་བདག་དང་བདག་གི་བ་མེད་པར་ལེགས་པར་ཐུགས་སུ་ཆུད་པས་བཟོད་པ་དང་བཟོད་པའི་འབྲས་བུ་དེ་ལ། །ལོག་པར་རྟོག་པར་གཏན་དུ་བསལ་ནས་ཞི་བར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Third, the tathāgatas have perfectly realized that there is no ‘me’ or ‘mine’ in patience and the results of patience; therefore, they have completely dispelled incorrect views of patience and its results, and thus this is called nirvāṇa. “

source: །བཞི་པ་ནི་དེ་བཞིན་གཤེགས་པས་བརྩོན་འགྲུས་དང་། བརྩོན་འགྲུས་ཀྱི་འབྲས་བུ་ལ་བདག་དང་། བདག་གི་བ་མེད་པར་ལེགས་པར་ཐུགས་སུ་ཆུད་པས་བརྩོན་འགྲུས་དང་བརྩོན་འགྲུས་ཀྱི་འབྲས་བུ་དེ་ལ་ལོག་པར་རྟོག་པ་གཏན་དུ་བསལ་ནས་ཞི་བར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Fourth, the tathāgatas have perfectly realized that there is no ‘me’ or ‘mine’ in diligence and the results of diligence; therefore, they have completely dispelled incorrect views of diligence and its results, and thus this is called nirvāṇa. “

source: །ལྔ་པ་ནི་དེ་བཞིན་གཤེགས་པས་བསམ་གཏན་དང་བསམ་གཏན་གྱི་འབྲས་བུ་ལ་བདག་དང་བདག་གི་བ་མེད་པར་ལེགས་པར་ཐུགས་སུ་ཆུད་པས་བསམ་གཏན་དང་བསམ་གཏན་གྱི་འབྲས་བུ་དེ་ལ་ལོག་པར་རྟོག་པ་གཏན་དུ་བསལ་ནས་ཞི་བར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Fifth, the tathāgatas have perfectly realized that there is no ‘me’ or ‘mine’ in meditation and the results of meditation; therefore, they have completely dispelled incorrect views of meditation and its results, and thus this is called nirvāṇa. “

source: །དྲུག་པ་ནི་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་དང་ཤེས་རབ་ཀྱི་འབྲས་བུ་ལ་བདག་དང་བདག་གི་བ་མེད་པར་ལེགས་པར་ཐུགས་སུ་ཆུད་པས་ཤེས་རབ་དང་ཤེས་རབ་ཀྱི་འབྲས་བུ་དེ་ལ་ལོག་པར་རྟོག་པ་གཏན་དུ་བསལ་ནས་ཞི་བར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Sixth, the tathāgatas have perfectly realized that there is no ‘me’ or ‘mine’ in wisdom and the results of wisdom; therefore, they have completely dispelled incorrect views of wisdom and its results, and thus this is called nirvāṇa. “

source: །བདུན་པ་ནི་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དང་སེམས་ཅན་མ་ཡིན་པ་ཐམས་ཅད་དང་ཆོས་ཐམས་ཅད་ལ་ངོ་བོ་ཉིད་མེད་པར་ལེགས་པར་ཐུགས་སུ་ཆུད་པས་ལོག་པར་རྟོག་པ་གཏན་དུ་བསལ་ནས་ཞི་བར་གྱུར་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: Seventh, the tathāgatas have perfectly realized that there is no essence within all beings and all that are not beings—in all phenomena—and so they have completely dispelled incorrect views of those. Thus, this is called nirvāṇa. “

source: །བརྒྱད་པ་ནི་གང་གིས་བདག་ཉིད་ལ་སྲེད་ཅིང་མངོན་པར་ཞེན་པ་དེས་ནི་ཡོངས་སུ་ཚོལ་བར་བྱེད་པ་ལ་ཡོངས་སུ་ཚོལ་བའི་ཕྱིར་ནི་སྡུག་བསྔལ་མང་པོ་མྱོང་པར་འགྱུར་བ་ཡིན་ན།
en: Eighth, those who have craving and attachment within themselves will be engaged in seeking. Because of being engaged in seeking, they will experience many different kinds of suffering.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་བདག་ཉིད་ལ་སྲེད་པ་སྤངས་པའི་ཕྱིར་ཡོངས་སུ་ཚོལ་བ་གཏན་དུ་བཅད་དེ་ཡོངས་སུ་ཚོལ་བ་མི་མངའ་བའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: The tathāgatas have perfectly realized that eliminating craving within oneself will bring seeking to an end, and therefore they have no seeking. Thus, this is called nirvāṇa. “

source: །དགུ་པ་ནི་འདུས་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་ནི་གྲངས་དང་ཚད་ཡོད་པ་ཡིན་ལ་འདུས་མ་བྱས་ཀྱི་ཆོས་གང་ཡིན་པ་དེ་ནི་གྲངས་དང་ཚད་སྤངས་པ་ཡིན་ཏེ།
en: Ninth, all composite phenomena have a number and measure, and noncomposite phenomena are free of number and measure.

source: དེ་བཞིན་གཤེགས་པ་ནི་འདུས་བྱས་ཀྱི་ཆོས་སྤངས་ཤིང་འདུས་མ་བྱས་ཀྱི་ཆོས་མངོན་དུ་མཛད་པས་གྲངས་དང་ཚད་མི་མངའ་བའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱའོ།
en: The tathāgatas have discarded composite phenomena and manifested noncomposite phenomena, and therefore have no number or measure. Thus, this is called nirvāṇa. “

source: །བཅུ་པ་ནི་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དང་ཆོས་ཀྱི་ངོ་བོ་ཉིད་ཐམས་ཅད་སྟོང་ཞིང་སྟོང་པ་ཉིད་ལས་གུད་ན་སྟོང་པའི་ངོ་བོ་ཉིད་ཡོད་པ་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ཉིད་ལ་ཡང་དག་པའི་ཆོས་ཀྱི་སྐུ་ཡིན་པར་ཐུགས་སུ་ཆུད་པའི་ཕྱིར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་སྟེ།
en: Tenth, the tathāgatas have perfectly realized that the nature of all beings and phenomena is empty and there is no existing essence of emptiness other than that emptiness—that itself is the true Dharma body, and thus this is called nirvāṇa. “

source: རིགས་ཀྱི་བུ་འདི་དག་ནི་མྱ་ངན་ལས་འདས་པ་ཡོད་པར་བསྟན་པའི་ཆོས་རྣམ་པ་བཅུ་ཞེས་བྱའོ།
en: Noble one, those are the ten qualities of the teaching that there is nirvāṇa. “

source: །གཞན་ཡང་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བ་གང་ཡིན་པ་དེ་ཡང་ཅི་ངོ་མཚར་རྨད་དུ་བྱུང་བ་མ་ཡིན་ནམ།
en: Also, noble one, why would the tathāgatas not passing into nirvāṇa not be a wondrous marvel?

source: གཞན་ཡང་ངོ་མཚར་གྱི་ཆོས་རྣམ་པ་བཅུ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཡིན་ཏེ།
en: There are also ten wondrous qualities of the Dharma, which are the activities of the tathāgatas. “

source: བཅུ་གང་ཞེ་ན།
en: What are these ten? “

source: འཁོར་བ་ནི་ཉེས་དམིགས་དང་བཅས་པ་ཡིན་ལ།
en: First, saṃsāra has defects while nirvāṇa is peace.

source: མྱ་ངན་ལས་འདས་པ་ནི་ཉེ་བར་ཞི་བ་ཡིན་ཡང་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་མཉམ་པ་ཉིད་དུ་མཁྱེན་པའི་ཕྱིར་འཁོར་བར་མི་གནས་པར་ཡང་མི་འགྱུར་ལ།
en: But because they know the sameness of saṃsāra and nirvāṇa, they do not have the activity of either remaining in saṃsāra or remaining in nirvāṇa, but never weary of benefiting beings.

source: མྱ་ངན་ལས་འདས་པ་ལ་གནས་པར་ཡང་མི་མཛད་པས་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་སྐྱོ་བ་མི་སྐྱེད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཞེས་བྱའོ།
en: That is an activity of the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་རྣམས་ལ་འདི་སྙམ་དུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་འདི་དག་ནི་ཕྱིན་ཅི་ལོག་གི་ལྟ་བ་ལ་སྤྱོད་པས་ཉོན་མོངས་པ་རྣམས་ཀྱིས་དཀྲིས་ཤིང་ཉོན་མོངས་པར་གྱུར་པས་ངས་དེང་རྣམ་པར་ཕྱེ་སྟེ་ཁོང་དུ་ཆུད་པར་བྱས་ནས་རྣམ་པར་ཐར་བར་བྱའོ་སྙམ་དུ་མི་དགོངས་མོད་ཀྱི།
en: Second, concerning beings, the tathāgatas do not think, ‘These childlike, ordinary beings engage in incorrect views and so are bound by the kleśas. Therefore, today I will make them discern and understand, and then liberate them.’

source: འོན་ཀྱང་སྔོན་གྱི་བྱམས་པའི་དགེ་བའི་རྩ་བའི་མཐུས་སེམས་ཅན་དེ་དག་གི་དབང་པོ་དང་། རང་བཞིན་དང་། བསམ་པ་དང་། མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་རྟོག་པ་མི་སྐྱེད་པར་ཡང་རང་གི་ངང་གིས་ཡོངས་སུ་སྒྲོལ་བར་མཛད་ཅིང་།
en: Instead, through the power of their previous love and good roots, without any thought they spontaneously liberate those beings in accordance with their faculties, natures, wishes, and aspirations, and they give them valid teachings until the future’s end.

source: ཕྱི་མའི་མཐར་ཐུག་པའི་བར་དུ་ཡང་དག་པའི་བསྟན་པ་བཤད་ནས་ཕན་འདོགས་ཤིང་དགའ་བར་མཛད་པ་ལ་མཐར་ཐུག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཞེས་བྱའོ།
en: That is an activity of the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པ་ལ་ངས་དེང་གསུང་རབ་ཡན་ལག་བཅུ་གཉིས་བསྟན་ནས་སེམས་ཅན་ལ་ཕན་གདགས་པར་བྱའོ་སྙམ་པའི་དགོངས་པ་མི་མངའ་མོད་ཀྱི། འོན་ཀྱང་སྔོན་གྱི་བྱམས་པའི་དགེ་བའི་མཐུས་ཕྱི་མའི་མཐར་ཐུག་པའི་བར་དུ་སེམས་ཅན་དེ་དག་ལ་རྒྱ་ཆེར་བསྟན་པ་མཛད་པ་ལ་མཐར་ཐུག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཞེས་བྱའོ།
en: Third, even though the tathāgatas do not think, ‘I shall benefit beings today by teaching them the twelve forms of the teaching,’ nevertheless through the power of the virtue of their past kindness they teach beings extensively until the future’s end, which has no end.

source: །དེ་བཞིན་གཤེགས་པ་ལ་ངས་དེང་གྲོང་དང་གྲོང་ཁྱེར་དང་།
en: That is an activity of the tathāgatas. “

source: གྲོང་རྡལ་དེ་དག་ཏུ་སོང་སྟེ་རྒྱལ་པོ་དང་བློན་པོ་དང་བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། དམངས་རིགས་ལ་སོགས་པའི་ཕོ་བྲང་དང་། ཁྱིམ་དག་ཏུ་བསོད་སྙོམས་བསླང་བར་བྱའོ། །སྙམ་པའི་དགོངས་པ་མི་མངའ་མོད་ཀྱི།
en: Fourth, the tathāgatas do not think, ‘Today I shall go to the villages, towns, and suburbs and obtain alms from the palaces and homes of the kings, ministers, brahmins, kṣatriyas, vaiśyas, śūdras, and so on.’

source: འོན་ཀྱང་སྔོན་སྐུ་དང་གསུང་དང་ཐུགས་ཀྱི་སྤྱོད་པ་གོམས་པར་གྱུར་པའི་མཐུས་རང་གི་ངང་གིས་དེ་དག་ཏུ་གཤེགས་ནས་ཕན་པའི་དངོས་པོ་མཛད་ཅིང་བསོད་སྙོམས་སློང་བ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཞེས་བྱའོ།
en: Nevertheless, through the power of their previous habituation to certain conduct of body, speech, and mind, they spontaneously go there to bring benefit and receive alms. That is an activity of the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་བཀྲེས་པ་དང་། སྐོམ་པ་དང་། བཤང་གཅི་དང་། ཉམ་ཆུང་བའི་མཚན་མ་ཡང་མི་མངའ་ལ་བསོད་སྙོམས་སློང་བར་མཛད་ཀྱང་བཤོས་གསོལ་བ་མི་མངའ་ཞིང་རྣམ་པར་རྟོག་པ་ཡང་མི་མངའ་མོད་ཀྱི།
en: Fifth, in the bodies of the tathāgatas there is no hunger or thirst, no feces or urine, and no signs of weakness.

source: འོན་ཀྱང་རང་གི་ངང་གིས་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་བཤོས་གསོལ་བ་མངའ་བའི་མཚན་མ་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཞེས་བྱའོ།
en: Though they receive alms, they do not consume them and have no such thought to do so, but nevertheless, in order to benefit beings, they manifest the characteristics of consuming alms. That is an activity of the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པ་ལ་སེམས་ཅན་མང་པོ་འདི་དག་ལ་རབ་དང་། འབྲིང་དང་། ཐ་མ་ཡོད་པ་དེ་དག་གི་དབང་པོ་དང་རང་བཞིན་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་བསྟན་པར་བྱའོ་སྙམ་པའི་དགོངས་པ་མི་མངའ་མོད་ཀྱི།
en: Sixth, the tathāgatas do not think, ‘I shall teach the Dharma according to the higher, medium, and lesser capabilities of these many beings.’

source: འོན་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་རྟོག་པ་མི་མངའ་བར་ཡང་དེ་དག་གི་སྣོད་དང་དབང་པོའི་སྐྱོན་ཇི་ལྟ་བ་བཞིན་དུ་ཤིན་ཏུ་འཚམ་པར་དེ་དག་ལ་ཆོས་སྟོན་པར་མཛད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཞེས་བྱའོ།
en: Nevertheless, without thought, they teach the Dharma in exact accordance with the factors of their capabilities and capacities. That is an activity of the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པ་ལ་སེམས་ཅན་འདི་དག་ནི་ང་ལ་བཀུར་སྟི་དང་རིམ་གྲོ་མི་བྱེད་ཅིང་རྟག་པར་ང་ལ་སྨོད་པའི་ཚིག་འབྱིན་པར་བྱེད་པས་དེ་དག་དང་ལྷན་ཅིག་ཏུ་གཏམ་སྨྲ་བར་མི་བྱའོ། །སེམས་ཅན་འདི་དག་ནི་ང་ལ་བཀུར་སྟི་དང་རིམ་གྲོ་བྱེད་ཅིང་རྟག་པར་ངའི་བསྔགས་པ་རྗོད་པར་བྱེད་པས་ངས་དེ་དག་དང་ལྷན་ཅིག་ཏུ་གཏམ་སྨྲ་བར་བྱའོ་སྙམ་པའི་དགོངས་པ་མི་མངའ་མོད་ཀྱི།
en: Seventh, the tathāgatas do not think, ‘Those beings have no reverence and respect for me, always criticize and abuse me, and therefore I shall not speak to them, but these beings are always reverential and respectful to me and praise me, and so I shall speak with them.’

source: འོན་ཀྱང་དེ་བཞིན་གཤེགས་པས་བྱམས་པ་དང་ཐུགས་རྗེའི་དགོངས་པ་མཉམ་པ་བསྐྱེད་ནས་གཉིས་སུ་མེད་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཞེས་བྱའོ།
en: Instead, a tathāgata regards them all equally with love and compassion, without any duality. That is an activity of the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་བྱམས་སྡང་དང་། ང་རྒྱལ་དང་། འདོད་པ་དང་། སེར་སྣ་དང་། ཉོན་མོངས་པ་རྣམས་མི་མངའ་མོད་ཀྱི།
en: Eighth, the tathāgatas do not have love or hate, pride, desire, avarice, or kleśas.

source: འོན་ཀྱང་དེ་བཞིན་གཤེགས་པ་རྟག་པར་རབ་ཏུ་དབེན་པ་ལ་དགྱེས་ཤིང་འདོད་པ་ཆུང་བ་དང་།
en: Instead, they always praise delighting in solitude, having little desire, and avoiding crowds.

source: འདུ་འཛི་སྤངས་པ་ལ་བསྔགས་པ་བརྗོད་པར་མཛད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཞེས་བྱའོ།
en: That is an activity of the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པ་ནི་ཆོས་གཅིག་ཙམ་ཡང་མི་མཁྱེན་པའམ། ལེགས་པར་ཐུགས་སུ་མ་ཆུད་པ་མི་མངའ་བས་ཐམས་ཅད་དུ་མེ་ལོང་ལྟ་བུའི་ཡེ་ཤེས་མངོན་སུམ་དུ་གྱུར་ཅིང་རྣམ་པར་མི་རྟོག་པ་མི་མངའ་མོད་ཀྱི།
en: Ninth, there is not a single phenomenon that tathāgatas do not know or perfectly understand; they are directly perceived by wisdom that is like a mirror.

source: འོན་ཀྱང་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་གིས་ལས་ཀྱི་དངོས་པོ་མངོན་པར་འདུ་བྱེད་པ་གཟིགས་ནས་དེ་དག་གི་ཡིད་དང་མཐུན་པར་འཇུག་ཅིང་ཐབས་མཁྱེན་པས་དྲངས་ཏེ་ངེས་པར་འབྱུང་བ་ཐོབ་པར་མཛད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཞེས་བྱའོ།
en: Though they have no thoughts, the tathāgatas see the karma that beings create and, in accord with their minds, guiding them through methods, they cause them to come forth from saṃsāra. That is an activity of the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པ་ནི་གལ་ཏེ་སེམས་ཅན་ཁ་ཅིག་ཕྱུག་ཅིང་ལོངས་སྤྱོད་དང་ལྡན་པར་གྱུར་པ་གཟིགས་ན་ཡང་དགྱེས་པ་སྐྱེ་བར་མི་འགྱུར་ལ། དེ་དག་རྒུད་ཅིང་ཕོངས་པར་གྱུར་པ་གཟིགས་ན་ཡང་ཡོངས་སུ་གདུང་བ་སྐྱེ་བར་མི་འགྱུར་མོད་ཀྱི།
en: Tenth, the tathāgatas do not delight in seeing beings become wealthy and prospering, and they do not become distressed on seeing them decline and become poor.

source: འོན་ཀྱང་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དེ་དག་ཡང་དག་པའི་སྤྱོད་པ་མངོན་པར་བསྒྲུབས་པ་གཟིགས་པར་གྱུར་ནས་ཐོགས་པ་མི་མངའ་བའི་ཐུགས་རྗེ་ཆེན་པོས་རང་གི་ངང་གིས་ཡོངས་སུ་སྐྱོབ་ཅིང་སྡུད་པར་མཛད་པ་དང་། གལ་ཏེ་སེམས་ཅན་དེ་དག་ལོག་པའི་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པ་གཟིགས་པར་གྱུར་ན་ཐོགས་པ་མི་མངའ་བའི་ཐུགས་རྗེ་ཆེན་པོས་རང་གི་ངང་གིས་ཡོངས་སུ་སྐྱོབ་ཅིང་སྡུད་པར་མཛད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཞེས་བྱའོ།
en: Nevertheless, the tathāgatas spontaneously, with great unimpeded compassion, protect and gather those beings they see accomplishing correct conduct, and if they see beings accomplishing incorrect conduct, they also spontaneously, with great unimpeded compassion, protect and gather them. That is an activity of the tathāgatas. “

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་དེ་ལྟ་བུའི་ཡང་དག་པའི་མཛད་པ་དཔག་ཏུ་མེད་པ་མངའ་བར་སྟོན་པ་ཡིན་པར་རིག་པར་བྱ་ཞིང་།
en: Noble one, know in that way that the Tathāgata Arhat Samyaksaṃbuddhas manifest the possession of infinite valid activities.

source: ཁྱེད་ཀྱིས་འདི་དག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཡང་དག་པའི་མཚན་ཉིད་ཡིན་པར་རིག་པར་བྱའོ།
en: You should know that those are the true qualities of nirvāṇa. “

source: །རེས་འགའ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཡོད་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ཡང་ཐབས་མཁྱེན་པས་བསྟན་པ་ཡིན་ལ་རིང་བསྲེལ་བཞག་ནས་སེམས་ཅན་རྣམས་ཀྱིས་བཀུར་སྟི་དང་རིམ་གྲོ་བྱས་ཏེ་མཆོད་པ་བྱེད་པར་འགྱུར་བ་ཡང་དེ་བཞིན་གཤེགས་པའི་བྱམས་པའི་དགེ་བའི་རྩ་བའི་མཐུ་ལས་གྱུར་པ་ཡིན་པས་གང་གིས་མཆོད་པ་བྱས་པ་དེ་དག་མ་འོངས་པའི་དུས་ན་མི་ཁོམ་པ་བརྒྱད་དང་བྲལ་ཞིང་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་།
en: The passing into nirvāṇa that is sometimes seen is a manifestation made through wisdom in methods. When the tathāgatas leave relics, beings will respect them, venerate them, and make offerings to them. This occurs because of the power of the good roots of the kindness of the tathāgatas. Whoever makes those offerings will in the future be free of the eight unfavorable states, will honor tathāgatas, will meet kalyāṇamitras, will not discard a virtuous mind, will possess immeasurable ripening merit, will quickly set forth from saṃsāra, and will not be destroyed or bound by saṃsāra.

source: དགེ་བའི་བཤེས་གཉེན་དང་ཕྲད་ནས་དགེ་བའི་སེམས་སྟོར་བར་མི་འགྱུར་བ་དང་།
en: You should dedicate yourself without inattentiveness to accomplishing such sublime conduct as that.”

source: བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པ་དཔག་ཏུ་མེད་པ་དང་ལྡན་ཞིང་མྱུར་དུ་ངེས་པར་བྱུང་ནས་འཁོར་བ་དག་གིས་བླངས་ཤིང་འཆིང་བར་མི་འགྱུར་བས་འདི་ལྟ་བུའི་སྤྱོད་པ་གྱ་ནོམ་པ་གང་ཡིན་པ་དེ་ཁྱོད་ཀྱིས་ནན་ཏན་གྱིས་བསྒྲུབ་པར་བྱ་ཞིང་བག་མེད་པར་མི་བྱའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་སུམ་དུ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བ་དང་། ཤིན་ཏུ་ཟབ་པའི་མཛད་པ་བཀས་བཤད་པ་ཐོས་ནས་གུས་པས་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་བདག་ནི་དེང་གདོད་དེ་བཞིན་གཤེགས་པ་སྟོན་པ་ཆེན་པོ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བ་དང་།
en: Then the bodhisattva Ruciraketu, having heard directly from the Bhagavat the teaching on not passing into nirvāṇa and on extremely profound activities, placed his palms together in veneration and said, “From today onward, I will understand that the Tathāgata, the great teacher, does not pass into nirvāṇa and that his leaving relics is done to benefit beings.

source: རིང་བསྲེལ་བཞག་པ་ཡང་སེམས་ཅན་རྣམས་ལ་སྨན་པར་བགྱི་བ་ལགས་པར་ཁོང་དུ་ཆུད་པས་ལུས་དང་སེམས་དགའ་མགུ་རངས་ཤིང་ངོ་མཚར་རྨད་དུ་གྱུར་ཏོ་ཞེས་གསོལ་ཏོ།
en: Therefore, I am happy, pleased, joyful, and amazed and astonished.”

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པའི་ལེའུ་འདི་བསྟན་པ་ན་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྙེད་མི་མཉམ་པ་དང་མཉམ་པའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ།
en: When this chapter that teaches the lifespan of the Tathāgata was taught, all those innumerable, countless beings developed the aspiration for the highest, most complete enlightenment, which has no equal.

source: །དེ་བཞིན་གཤེགས་པ་བཞི་པོ་ཡང་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: The four tathāgatas vanished.

source: །བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་བྱས་ནས་འདུག་པའི་སྟན་ལས་ལངས་ཏེ་སླར་སྔོན་གྱི་གནས་སུ་སོང་ངོ་།
en: The bodhisattva Ruciraketu, having bowed down to the Bhagavat’s feet and having risen, returned to sit in that place.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བསྟན་པའི་ལེའུ་སྟེ་གཉིས་པའོ།། །།གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ། བམ་པོ་གཉིས་པ།
en: This concludes “The Teaching of the Lifespan of the Tathāgata,” the second chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་འཁོར་མང་པོའི་ནང་ནས་འདུག་པའི་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་གུས་པས་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ།
en: Chapter 3: The Differentiation of the Three Bodies Then the bodhisattva mahāsattva Ākāśagarbha rose from his seat among that great assembly and, with his upper robe over one shoulder, knelt on his right knee, reverently placed his palms together, and bowed his head to the Bhagavat’s feet.

source: གསེར་དང་རིན་པོ་ཆེའི་མེ་ཏོག་དང་རིན་པོ་ཆེའི་རྒྱལ་མཚན་དང་། བ་དན་དང་། གདུགས་མཆོག་དམ་པས་མཆོད་པ་བྱས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཤིན་ཏུ་ཟབ་པའི་གསང་བ་དག་ལ་ཆོས་བཞིན་དུ་མངོན་པར་བསྒྲུབ་པར་བགྱི་ལགས།
en: He made offerings of flowers made of gold and jewels, precious banners, flags, and sublime, supreme parasols, and then he asked the Bhagavat, “Bhagavat, how can bodhisattvas mahāsattvas accomplish in accordance with the Dharma the extremely profound secret of the tathāgatas?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ལེགས་པར་ཉོན་ལ་ཤིན་ཏུ་ཡིད་ལ་ཟུངས་ཤིག་དང་།
en: The Bhagavat said, “Noble one, listen well and keep this in mind!

source: ངས་ཁྱོད་ལ་རྣམ་པར་ཕྱེ་སྟེ་བསྟན་པར་བྱའོ།
en: I shall reveal that to you. “

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་སྐུ་རྣམ་པ་གསུམ་མངའ་སྟེ་གསུམ་གང་ཞེ་ན།
en: Noble one, all tathāgatas have three kinds of bodies. What are these three?

source: སྤྲུལ་པའི་སྐུ་དང་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུ་དང་ཆོས་ཀྱི་སྐུ་གང་ཡིན་པའོ།
en: They are the emanation body, the perfect enjoyment body, and the Dharma body.

source: །འདི་ལྟར་སྐུ་རྣམ་པ་གསུམ་པོ་འདི་དག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་སྡུད་བར་བྱེད་དེ།
en: Just so, these three bodies are comprised within the perfection of the highest, most complete enlightenment.

source: གང་གིས་ཡང་དག་པར་རྟོགས་ཤིང་ཁོང་དུ་ཆུད་པར་གྱུར་ན་མྱུར་དུ་འཁོར་བ་ལས་ངེས་པར་འབྱུང་བར་འགྱུར་རོ།
en: Whoever understands and comprehends this will quickly set forth from saṃsāra. “

source: །བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་སྤྲུལ་པའི་སྐུ་ཁོང་དུ་ཆུད་པར་བྱ་ཞེ་ན།
en: How should bodhisattvas understand the emanation body?

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་སྔོན་སྤྱོད་པའི་ས་ལ་གནས་པ་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆེད་དུ་ཆོས་རྣམ་པ་སྣ་ཚོགས་མངོན་པར་བསྒྲུབས་སོ།
en: Noble one, in the past, when the tathāgatas were purifying the bhūmis, they accomplished all kinds of Dharma for the sake of all beings.
